{
  "backend/main.mo": "Main canister implementing authorization, blob storage, user profiles, and conversation/message data with admin/user permission checks.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by adding an empty conversations map.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the responsibilities of various frontend components, hooks, utilities, and styles.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Checklist outlining prerequisites, steps, verification, rollback, and troubleshooting for promoting a preview build to production.",
  "frontend/index.css": "Global Tailwind CSS layer defining OKLCH-based color variables, light/dark themes, and base styles.",
  "frontend/index.html": "Minimal HTML entry point loading the root element and main React script.",
  "frontend/src/App.tsx": "Root React component managing splash screen, authentication flow, navigation between landing and chats, and global providers.",
  "frontend/src/components/AppHeader.tsx": "Header component providing navigation, authentication handling, and user menu with conditional options based on login state.",
  "frontend/src/components/BrandLogo.tsx": "Displays the Vibechat logo image with fallback text if loading fails, supporting multiple size presets.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Modal dialog for capturing photos using the device camera with error handling, switching cameras, and returning a captured file.",
  "frontend/src/components/chat/ConversationDetail.tsx": "Displays a conversation view with header info, participant avatar, message timeline, and composer, loading participant data dynamically.",
  "frontend/src/components/chat/ConversationList.tsx": "Shows the user's conversations, handles loading and errors, and renders selectable conversation rows with participant info.",
  "frontend/src/components/chat/MessageComposer.tsx": "Handles composing and sending messages with text and media attachments, including file validation and upload progress.",
  "frontend/src/components/chat/MessageTimeline.tsx": "Fetches and renders message history with media support, indicates sender identity, and auto-scrolls to latest messages.",
  "frontend/src/components/chat/NewConversationDialog.tsx": "Dialog for creating a new conversation by validating a Principal ID and invoking the create conversation mutation.",
  "frontend/src/components/ContactsSyncDialog.tsx": "Dialog for syncing contacts via the Contacts Picker API or manual entry, matching them to Vibechat users and starting chats.",
  "frontend/src/components/ProfileDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "Lets users choose or capture a profile photo, validates image files, and previews the selection.",
  "frontend/src/components/SplashScreen.tsx": "Shows an animated splash screen with fade-out timing before calling a dismissal callback.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi-step authentication flow including phone entry, verification, and profile setup with optional photo upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including loading, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, phone availability, and password management using the actor backend.",
  "frontend/src/index.css": "Tailwind CSS setup defining custom light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ChatsPage.tsx": "Implements the chat UI layout with conversation list, detail view, and new‑conversation handling.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, features, and navigation actions for auth, contacts, and chats.",
  "frontend/src/utils/fileBytes.ts": "Validates image files and reads them into Uint8Array for profile image uploads.",
  "frontend/src/utils/phoneNumbers.ts": "Utilities for normalizing and extracting phone numbers from text or contacts and checking API support.",
  "frontend/src/utils/readFileAsBytesAny.ts": "Validates and reads image or video files into Uint8Array for message attachments.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theme extensions, typography, container queries, animations, and custom color variables.",
  "project_state.json": "Tracks the project's overall state, versioning, requirements, architectural notes, and known issues for the Vibechat app."
}