{
  "backend/main.mo": "Motoko backend canister implementing user profiles, phone checks, and conversation/message storage with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short functional summaries for documentation or tooling.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Markdown checklist outlining steps, verification, rollback, and troubleshooting for promoting a preview build to production.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light/dark modes using a custom OKLCH color system.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component handling routing, authentication flow, section navigation, splash screen, and dialogs.",
  "frontend/src/components/AppHeader.tsx": "Renders the top navigation bar with branding, section navigation, and authentication controls, adapting behavior based on user login state.",
  "frontend/src/components/BrandLogo.tsx": "Displays the Vibechat logo image with size options and falls back to text if the image fails to load.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Provides a dialog for capturing photos using the device camera, handling camera initialization, errors, and returning the captured file.",
  "frontend/src/components/chat/ConversationDetail.tsx": "Displays a conversation view with participant info, message timeline, and message composer, handling loading and back navigation.",
  "frontend/src/components/chat/ConversationList.tsx": "Renders the user's conversations list with participant previews, loading/error states, and selection handling.",
  "frontend/src/components/chat/MessageComposer.tsx": "Provides a text and media message composer with upload progress, WhatsApp sharing, and message sending logic.",
  "frontend/src/components/chat/MessageTimeline.tsx": "Fetches and displays messages with attachments, timestamps, and auto-scrolling, handling loading and errors.",
  "frontend/src/components/chat/NewConversationDialog.tsx": "Modal dialog for creating a new conversation by entering and validating a Principal ID.",
  "frontend/src/components/ContactsSyncDialog.tsx": "Enables users to sync contacts via the Contacts Picker or manual input, match them with Vibechat users, and start chats with matched profiles.",
  "frontend/src/components/ProfileDialog.tsx": "Empty placeholder file for a profile dialog component.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "Lets users upload or capture a profile photo, validating files and showing a preview before selection.",
  "frontend/src/components/SplashScreen.tsx": "Shows a temporary splash screen with a fading animation and logo before the app loads.",
  "frontend/src/components/videos/mockSponsoredItems.ts": "Defines the SponsoredVideoItem interface and provides mock sponsored video data.",
  "frontend/src/components/videos/SponsoredVideoFeed.tsx": "Shows a grid of sponsored video items with thumbnails and opens a viewer when an item is selected.",
  "frontend/src/components/videos/SponsoredVideoViewer.tsx": "A modal video viewer that displays sponsored video content with simulated playback progress and details.",
  "frontend/src/components/videos/useSimulatedPlaybackProgress.ts": "A hook that simulates video playback progress over time and triggers a completion callback.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi-step authentication flow including phone input, verification, and profile setup with photo upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile operations, phone checks, and password management using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines theme variables for light and dark modes with a warm color palette.",
  "frontend/src/main.tsx": "Initializes the app root, providing React Query and Internet Identity contexts around the main App component.",
  "frontend/src/pages/ChatsPage.tsx": "Renders chat list and details with mobile-friendly navigation and a dialog for creating new conversations.",
  "frontend/src/pages/GroupsPage.tsx": "Displays a placeholder UI announcing that group features are coming soon.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, features, and CTA sections using UI components and navigation callbacks.",
  "frontend/src/pages/LivePage.tsx": "Static placeholder page displaying a coming-soon message for live audio/video features.",
  "frontend/src/pages/StatusPage.tsx": "Static placeholder page showing a coming-soon message for disappearing status updates.",
  "frontend/src/pages/VideosPage.tsx": "Videos page showing sponsored video feed and an informational alert about demo content.",
  "frontend/src/utils/fileBytes.ts": "Validates image files and reads them into Uint8Array for profile picture handling.",
  "frontend/src/utils/phoneNumbers.ts": "Utilities for normalizing, extracting, deduplicating phone numbers and detecting Contacts Picker support.",
  "frontend/src/utils/readFileAsBytesAny.ts": "Validates and reads image/video files into Uint8Array for message attachments.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsappShare.ts": "Builds and opens WhatsApp web share URLs with prefilled text.",
  "frontend/tailwind.config.js": "Tailwind configuration defining themes, colors, fonts, container settings, plugins, and custom extensions.",
  "project_state.json": "Contains the current vibechat project state, including UI direction, architectural constraints, known issues, and tracked features. Also lists image requirements and version/deployment inconsistencies relevant to ongoing development."
}