{
  "backend/main.mo": "Motoko actor handling user profiles with access control, phone checks, and profile picture storage using mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Detailed checklist for promoting a preview build to production with verification, deployment, monitoring, and rollback steps.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH‑based color variables and light/dark theme tokens.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring splash screen, header, landing page, auth dialog, and React Query provider.",
  "frontend/src/components/AppHeader.tsx": "Header showing logo and auth/profile controls with Internet Identity and profile state handling.",
  "frontend/src/components/BrandLogo.tsx": "Logo component displaying an image with text fallback on load error.",
  "frontend/src/components/ProfileDialog.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/SplashScreen.tsx": "Splash screen with timed fade‑out and animated loading dots.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi-step WhatsApp-like authentication and profile setup flow including phone validation, II login, and profile picture upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, login flow, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile data, phone availability, and password operations via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind and defines a warm-themed color system with light and dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero content, features, and a CTA triggering authentication.",
  "frontend/src/utils/fileBytes.ts": "Provides image file validation and utilities for converting uploaded files to byte arrays.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, breakpoints, animations, and plugin setup.",
  "project_state.json": "Describes the project's current state, scope, architecture notes, known issues, and existing feature definitions."
}