{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, phone validation, and conversation/message storage with media attachments.",
  "feature_evidence.json": "Feature evidence report mapping high-level feature requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of key frontend files describing navigation, components, utilities, and styling.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Detailed checklist for promoting a preview build to production, including verification, deployment, and rollback steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables, dark mode rules, and base element styles.",
  "frontend/index.html": "HTML entry point setting up the root container and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app controlling authentication, section-based navigation, splash screen, and dialogs for profile setup and contacts sync.",
  "frontend/src/components/AppHeader.tsx": "Renders the main app header with logo, navigation, auth handling, and user profile menu, restricting certain sections unless authenticated.",
  "frontend/src/components/BrandLogo.tsx": "Displays the Vibechat logo image with fallback text styling if loading fails, supporting multiple size options.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Provides a dialog for taking photos using the device camera, handling permissions, errors, preview, and capture actions.",
  "frontend/src/components/chat/ConversationDetail.tsx": "Displays a conversation view with participant header, message timeline, and composer, loading participant info when needed.",
  "frontend/src/components/chat/ConversationList.tsx": "Shows the user’s conversation list with loading and error states, allowing selection of a conversation.",
  "frontend/src/components/chat/MessageComposer.tsx": "Handles composing and sending messages with text, media attachments, upload progress, and optional WhatsApp sharing.",
  "frontend/src/components/chat/MessageTimeline.tsx": "Fetches and displays messages with media support, handling loading, errors, and auto-scrolling.",
  "frontend/src/components/chat/NewConversationDialog.tsx": "Dialog for creating a new conversation by entering and validating a Principal ID.",
  "frontend/src/components/ContactsSyncDialog.tsx": "Lets users sync and match contacts via picker or manual input, showing matched Vibechat users and sync results.",
  "frontend/src/components/ProfileDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "Allows users to choose or capture a profile photo, validating files and previewing the selected image.",
  "frontend/src/components/SplashScreen.tsx": "Shows an initial splash screen with logo and animated dots, fading out automatically after a set duration.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi-step authentication flow including phone entry, verification, and profile setup with photo upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including creating AuthClient instances and exposing login state and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with user-related canister methods such as profiles, phone availability, and password management.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines light/dark theme CSS variables for colors, layout, and UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ChatsPage.tsx": "Displays the chat interface with a conversation list, conversation detail view, and a dialog for starting new chats.",
  "frontend/src/pages/GroupsPage.tsx": "Renders a placeholder page indicating that group chat functionality is coming soon.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero content, feature highlights, and navigation actions.",
  "frontend/src/pages/LivePage.tsx": "Shows a placeholder page announcing upcoming live audio/video broadcast features.",
  "frontend/src/pages/StatusPage.tsx": "Displays a placeholder page for a future disappearing-status feature.",
  "frontend/src/pages/VideosPage.tsx": "Provides a placeholder page indicating that video-sharing features are in development.",
  "frontend/src/utils/fileBytes.ts": "Validates image files by type and size, then reads them into a Uint8Array using FileReader.",
  "frontend/src/utils/phoneNumbers.ts": "Provides utilities to normalize, extract, and deduplicate phone numbers from text or contacts and detect Contacts Picker support.",
  "frontend/src/utils/readFileAsBytesAny.ts": "Validates images or videos up to 50MB and reads them as Uint8Array for attachments.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with sessionStorage support and hash‑based routing compatibility.",
  "frontend/src/utils/whatsappShare.ts": "Builds and opens WhatsApp Web share URLs with prefilled text.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes project state, goals, constraints, existing features, and known issues for the Vibechat app."
}