{
  "backend/main.mo": "Actor manages user profiles with access control, phone-number checks, and profile‑picture blob storage APIs.",
  "feature_evidence.json": "Feature evidence report linking a profile photo picker enhancement to related frontend files and components.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing their roles in the application.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Checklist describing steps, verification, rollback, and troubleshooting for promoting a preview build to production.",
  "frontend/index.css": "Tailwind base configuration defining OKLCH color variables, light/dark themes, and global styling rules.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app setting up query provider, splash screen, landing layout, header, auth dialog, and toaster.",
  "frontend/src/components/AppHeader.tsx": "Header showing logo and auth/profile controls based on identity and profile query state.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that displays the vibechat image or text fallback on load failure.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Modal dialog that initializes the camera, displays preview, handles errors, captures photos, and returns the resulting file.",
  "frontend/src/components/ProfileDialog.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "Lets users select or capture a profile photo, validates images, and shows a preview avatar with initials fallback.",
  "frontend/src/components/SplashScreen.tsx": "Displays a timed splash screen with fade‑out animation and a pulsing logo before dismissing.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi‑step auth flow with phone entry, verification, and profile setup including photo upload and profile saving.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profile data, phone availability, and password operations via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme color variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero, features, and CTA sections using styled UI components.",
  "frontend/src/utils/fileBytes.ts": "Provides image file validation and a utility to read files into Uint8Array for profile pictures.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors, typography, animations, and container settings using CSS variables.",
  "project_state.json": "Describes current project status, issues, architecture constraints, and implemented features for Vibechat."
}