{
  "backend/main.mo": "Motoko backend actor handling user profiles, phone checks, profile pictures, and conversation/message structures with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping PWA install UI updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing major frontend components, utilities, pages, and styling files.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Markdown checklist detailing steps, verification, rollback, and troubleshooting for promoting a preview build to production.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Root HTML document setting meta tags, manifest links, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and start configuration.",
  "frontend/public/sw.js": "Service worker implementing install/activate handlers with cache-first shell asset caching and network-first fallback.",
  "frontend/src/App.tsx": "Main app component handling authentication flow, splash screen, onboarding, and navigation between sections.",
  "frontend/src/components/AppHeader.tsx": "Top navigation bar showing branding, user auth actions, and section switches based on authentication.",
  "frontend/src/components/BrandLogo.tsx": "Renders the Vibechat logo with fallback text if the image fails to load.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Modal dialog for capturing a photo using the device camera with error handling and switching cameras.",
  "frontend/src/components/chat/ai/AIHelperSheet.tsx": "Bottom sheet UI that displays on-device smart reply suggestions based on the latest received message.",
  "frontend/src/components/chat/ConversationDetail.tsx": "Displays a conversation view with header, message timeline, composer, and AI helper integration.",
  "frontend/src/components/chat/ConversationList.tsx": "Lists user conversations, showing participant info with loading, error, and empty states.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input box supporting text, attachments, smart replies, rewrite suggestions, and optional WhatsApp sharing.",
  "frontend/src/components/chat/MessageTimeline.tsx": "Renders messages with attachments, timestamps, and like/unlike support, auto‑loading via hooks.",
  "frontend/src/components/chat/NewConversationDialog.tsx": "Modal dialog allowing users to enter and validate a Principal ID, then create a conversation using a mutation hook.",
  "frontend/src/components/ContactsSyncDialog.tsx": "Dialog allowing users to sync phone contacts, match them to Vibechat users, and optionally start chats.",
  "frontend/src/components/ProfileDialog.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "UI component for selecting or capturing a profile photo, validating files, and showing previews.",
  "frontend/src/components/PWAInstallCallout.tsx": "Callout prompting users to install the PWA, with localStorage persistence and install flow handling.",
  "frontend/src/components/SplashScreen.tsx": "Splash screen component that fades out after a timed delay and then triggers onDismiss.",
  "frontend/src/components/videos/mockSponsoredItems.ts": "Static mock data defining sponsored video items with titles, descriptions, thumbnails, and durations.",
  "frontend/src/components/videos/SponsoredVideoFeed.tsx": "Grid feed of sponsored video cards that open a viewer when selected.",
  "frontend/src/components/videos/SponsoredVideoViewer.tsx": "Dialog viewer for a sponsored video that simulates playback progress and shows metadata.",
  "frontend/src/components/videos/useSimulatedPlaybackProgress.ts": "Custom hook that simulates video playback progress over time and triggers completion callbacks.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Multi‑step auth dialog handling phone entry, verification, and profile setup with photo upload and Internet Identity login.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Custom hook that captures the PWA install prompt event and exposes installability state and a trigger function.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profile, password, phone checks, and related backend actor calls.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, color palettes, and base styles for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and mounts the root component.",
  "frontend/src/pages/ChatsPage.tsx": "Renders chat list and conversation detail views with mobile-friendly navigation and new chat dialog support.",
  "frontend/src/pages/GroupsPage.tsx": "Static placeholder page indicating upcoming group chat functionality.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with branding, PWA install callout, and sign‑in CTA.",
  "frontend/src/pages/LivePage.tsx": "Placeholder page announcing future live audio/video broadcast features.",
  "frontend/src/pages/PeoplePage.tsx": "Displays users with follow/unfollow actions, using several query hooks and interactive user cards.",
  "frontend/src/pages/PreLoginIntroPage.tsx": "Intro screen shown before login with branding, PWA install prompt, skip option, and sign‑in button.",
  "frontend/src/pages/StatusPage.tsx": "Displays a placeholder Status page using card components and a coming‑soon message.",
  "frontend/src/pages/VideosPage.tsx": "Renders the Videos page with a header, demo alert, and a SponsoredVideoFeed component.",
  "frontend/src/utils/aiRewrite.ts": "Provides deterministic text‑rewriting utilities with shorter, friendly, and formal modes using simple heuristics.",
  "frontend/src/utils/aiSmartReplies.ts": "Generates deterministic smart replies based on keyword matching and message patterns.",
  "frontend/src/utils/fileBytes.ts": "Validates image files and reads them into Uint8Array buffers for profile picture handling.",
  "frontend/src/utils/onboardingStorage.ts": "Stores and checks a flag in localStorage to track whether onboarding has been dismissed.",
  "frontend/src/utils/phoneNumbers.ts": "Extracts and normalizes phone numbers from text or contacts and checks Contacts Picker API support.",
  "frontend/src/utils/pwaInstallCalloutStorage.ts": "Manages localStorage state for hiding or resetting the PWA install callout.",
  "frontend/src/utils/readFileAsBytesAny.ts": "Validates image/video files up to 50MB and reads them into Uint8Array buffers for attachments.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker in production environments and logs update events.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/whatsappShare.ts": "Builds and opens WhatsApp Web share URLs with prefilled text.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugin integration, extended color system via CSS variables, custom fonts, shadows, radius, and keyframe animations.",
  "project_state.json": "Project state describing Vibechat’s WhatsApp-like UI direction, PWA goals, Internet Identity constraints, onboarding changes, feature requests, and known deployment/login issues."
}