{
  "backend/main.mo": "Motoko backend actor providing user profiles, phone checks, and conversation/message storage with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping PWA-related features to files, components, and tests with high-confidence metadata.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of key frontend components, hooks, utilities, and pages.",
  "frontend/DEPLOYMENT_PROMOTION_CHECKLIST.md": "Markdown checklist describing steps, verification, rollback, and troubleshooting for promoting a preview build to production.",
  "frontend/index.css": "Tailwind CSS base file defining global variables, OKLCH color tokens, and light/dark theme mappings.",
  "frontend/index.html": "HTML entry point including PWA metadata, manifest link, icons, and script bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "Web App Manifest defining Vibechat's PWA metadata including names, colors, icons, category, and start URL.",
  "frontend/public/sw.js": "Service worker implementing install/activate handlers and cache-first or network-first strategies for assets and app files.",
  "frontend/src/App.tsx": "Main app component handling authentication state, onboarding flow, splash screen, navigation, and section rendering. Integrates service worker registration and profile setup triggers.",
  "frontend/src/components/AppHeader.tsx": "Header component showing branding, navigation buttons, and auth/profile actions with section switching and login handling.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that displays an image or fallback text styling if the image fails to load.",
  "frontend/src/components/CameraCaptureDialog.tsx": "Dialog for taking photos using the device camera, handling permissions, errors, switching cameras, and returning a captured file.",
  "frontend/src/components/chat/ai/AIHelperSheet.tsx": "Bottom sheet that generates simple on-device smart reply suggestions and lets users insert them into chat input.",
  "frontend/src/components/chat/ConversationDetail.tsx": "Displays a conversation view with header info, message timeline, composer, and AI assistant, using participant and message data.",
  "frontend/src/components/chat/ConversationList.tsx": "Renders the user’s conversation list with loading, error, and empty states, and lets users select a conversation.",
  "frontend/src/components/chat/MessageComposer.tsx": "Handles composing and sending messages with text, attachments, smart replies, rewrite options, and optional WhatsApp sharing.",
  "frontend/src/components/chat/MessageTimeline.tsx": "Shows a scrollable timeline of messages with text, attachments, timestamps, and loading/error states, auto‑scrolling to new messages.",
  "frontend/src/components/chat/NewConversationDialog.tsx": "Dialog UI for creating a new conversation by validating a Principal ID and invoking the create-conversation mutation.",
  "frontend/src/components/ContactsSyncDialog.tsx": "Dialog for syncing contacts via contacts picker or manual input, matching users, showing results, and allowing chat initiation.",
  "frontend/src/components/ProfileDialog.tsx": "Empty file placeholder for a profile dialog component.",
  "frontend/src/components/ProfilePhotoPicker.tsx": "Component allowing users to select or capture a profile photo with validation, previewing, and camera dialog integration.",
  "frontend/src/components/PWAInstallCallout.tsx": "Callout prompting installation of the PWA with install button, dismiss logic, and support detection.",
  "frontend/src/components/SplashScreen.tsx": "Shows an animated splash screen that fades out after a timed delay and then triggers the onDismiss callback.",
  "frontend/src/components/videos/mockSponsoredItems.ts": "Static list of mock sponsored video metadata used for the feed and viewer.",
  "frontend/src/components/videos/SponsoredVideoFeed.tsx": "Grid view displaying sponsored video cards and opening the video viewer when an item is selected.",
  "frontend/src/components/videos/SponsoredVideoViewer.tsx": "Dialog-based viewer that shows sponsored video details with simulated playback progress and closing controls.",
  "frontend/src/components/videos/useSimulatedPlaybackProgress.ts": "React hook that simulates timed playback progress with interval updates and a reset function.",
  "frontend/src/components/WhatsAppStyleAuth.tsx": "Implements a multi‑step WhatsApp‑like authentication flow with phone entry, identity verification, and profile setup with photo upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and auth client configuration.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Provides a hook for capturing and triggering the PWA install prompt and tracking installability.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, password management, and phone number availability with Internet Identity actor integration.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme color palettes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity provider and mounts App component.",
  "frontend/src/pages/ChatsPage.tsx": "Implements chat UI with conversation list, detail view, and new conversation dialog supporting mobile navigation.",
  "frontend/src/pages/GroupsPage.tsx": "Placeholder page displaying a coming-soon message for group conversations.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with branding, PWA callout, and sign-in CTA.",
  "frontend/src/pages/LivePage.tsx": "Placeholder page announcing upcoming live audio/video features.",
  "frontend/src/pages/PreLoginIntroPage.tsx": "Intro screen shown before login with branding, install prompt, skip button, and sign-in CTA.",
  "frontend/src/pages/StatusPage.tsx": "Placeholder page for the future disappearing status feature.",
  "frontend/src/pages/VideosPage.tsx": "Videos page showing sponsored video feed with informational alert.",
  "frontend/src/utils/aiRewrite.ts": "Provides deterministic text rewriting with shorter, friendly, and formal modes using regex-based heuristics.",
  "frontend/src/utils/aiSmartReplies.ts": "Generates deterministic smart reply suggestions based on keyword matching and templates.",
  "frontend/src/utils/fileBytes.ts": "Validates image files and reads them into Uint8Array buffers for profile picture handling.",
  "frontend/src/utils/onboardingStorage.ts": "Stores and retrieves a flag in localStorage indicating whether onboarding has been dismissed.",
  "frontend/src/utils/phoneNumbers.ts": "Normalizes and extracts phone numbers from text or contacts, with browser API support checks.",
  "frontend/src/utils/readFileAsBytesAny.ts": "Validates image/video files and reads any allowed media file into a Uint8Array for attachments.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker in production, logs status, and handles update detection.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsappShare.ts": "Generates WhatsApp Web share URLs and opens them in a new tab for text sharing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, fonts, plugins, and extended utilities.",
  "project_state.json": "JSON outlining Vibechat’s targeted WhatsApp-like UI, onboarding, PWA requirements, II-based authentication rules, and platform constraints. Includes architectural notes, image requirements, and a list of deployment and login issues."
}