{
  "kind": "build_request",
  "title": "Populate the Videos tab with a simple sponsored/ad-style watch feed (frontend-only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Replace the current placeholder content in `frontend/src/pages/VideosPage.tsx` with a simple, scrollable “Sponsored” video feed that gives users something to watch, using frontend-only mock ad items (no backend changes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Is there anyway you can add Atleast ads on that part of videos Atleast for it to have something to watch"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to the Videos tab shows a feed of at least 3 sponsored/ad-style items instead of the current “Videos is coming soon.” card.",
        "Each feed item is clearly labeled in English as sponsored content (e.g., “Sponsored”).",
        "Each feed item has a thumbnail image, a short title, and a short description (English).",
        "No backend canister methods are added/changed to support this feed."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Implement a basic in-app “watch” experience for the sponsored items in the Videos tab (e.g., tapping an item opens a modal/sheet with a full-bleed vertical viewer that simulates playback using an animated progress indicator and item details), entirely client-side.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add Atleast ads on that part of videos Atleast for it to have something to watch"
        ]
      },
      "acceptanceCriteria": [
        "Clicking/tapping a sponsored item opens a dedicated viewer (modal/sheet/page section) that presents the ad item in a watchable format.",
        "The viewer includes a visible progress indicator that advances automatically (e.g., 10–15 seconds) and provides a clear close/back control.",
        "User-facing labels and messaging are in English and do not claim the content is from a real ad network."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a small disclaimer in the Videos tab UI clarifying that the sponsored items are sample/demo content (English), and ensure the layout works well on both mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add Atleast ads on that part of videos Atleast for it to have something to watch"
        ]
      },
      "acceptanceCriteria": [
        "A short disclaimer appears in the Videos tab (e.g., near the top of the feed) indicating the items are sample/demo sponsored content.",
        "The feed and viewer are responsive and usable on small mobile screens and desktop widths without horizontal overflow."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Add the required generated ad thumbnail images under `frontend/public/assets/generated/` and render them in the Videos tab feed items (do not fetch thumbnails via the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ]
      },
      "acceptanceCriteria": [
        "All generated thumbnails exist at `frontend/public/assets/generated/` and are referenced by the Videos tab via static paths (e.g., `/assets/generated/...`).",
        "Thumbnails render crisply (no broken images) in both light and dark mode."
      ]
    }
  ],
  "constraints": [
    "Do not add or integrate third-party ad networks (no Google AdSense or similar).",
    "Do not add new backend canisters/services; keep this change frontend-only.",
    "Do not edit files under `frontend/src/components/ui` or other paths listed in `frontend.immutablePaths`.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Real monetization, payouts, impressions/click tracking, or analytics.",
    "Server-side ad selection, targeting, or user profiling.",
    "Uploading user videos or building full video-sharing functionality in this change."
  ],
  "imageRequirements": {
    "required": [
      "Abstract sponsored video thumbnail with bold shapes and high contrast (vibechat-sponsored-1.dim_720x1280.png)",
      "Abstract sponsored video thumbnail with product-style silhouette and clean gradients (vibechat-sponsored-2.dim_720x1280.png)",
      "Abstract sponsored video thumbnail with dynamic pattern and minimal iconography (vibechat-sponsored-3.dim_720x1280.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}