{
  "kind": "build_request",
  "title": "Enable Vibechat as an installable PWA (Add to Home Screen)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-45",
      "text": "Add a Web App Manifest for Vibechat so modern browsers recognize the site as an installable PWA, including app name/short_name, start_url, display mode, theme/background colors, and icon declarations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PWA can do"
        ]
      },
      "acceptanceCriteria": [
        "A manifest file exists under the frontend static/public assets (e.g., `frontend/public/manifest.webmanifest` or `frontend/public/manifest.json`).",
        "The manifest includes: `name` = \"Vibechat\", `short_name` = \"Vibechat\", `start_url`, `display` (standalone), `background_color`, `theme_color`, and an `icons` array with at least 192x192 and 512x512 PNG icons (including a maskable icon).",
        "The app can be installed on supported browsers (Chrome/Edge/Android) without manifest-related console errors."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Update `frontend/index.html` to include the required PWA metadata: link to the manifest, theme-color meta tag, and appropriate icon links (including an Apple touch icon).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PWA can do"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` includes a `<link rel=\"manifest\" ...>` pointing to the manifest file.",
        "`frontend/index.html` includes `<meta name=\"theme-color\" ...>` matching the manifest theme color.",
        "`frontend/index.html` references a favicon and an Apple touch icon file that exist in the frontend public assets.",
        "The page still loads normally and the document title remains \"vibechat\" (unless explicitly updated as part of PWA metadata)."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Add a service worker file to enable baseline PWA behavior (at minimum: registerable service worker and lightweight caching for core shell assets) without introducing runtime errors in unsupported browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PWA can do"
        ]
      },
      "acceptanceCriteria": [
        "A service worker file exists in frontend public assets (e.g., `frontend/public/sw.js`) and can be fetched at `/sw.js`.",
        "The service worker installs and activates successfully in supported browsers (no uncaught exceptions).",
        "Core app shell requests needed to load the UI are cached in a safe, minimal way (e.g., cache-first for the shell, network-first for dynamic requests), and the caching logic does not break authenticated usage.",
        "When the service worker is registered, the app still functions normally online."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Register the service worker from within the editable React codebase (do not modify immutable files such as `frontend/src/main.tsx`) and ensure registration is performed only in production-like environments and supported browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PWA can do"
        ]
      },
      "acceptanceCriteria": [
        "Service worker registration is triggered from an editable file (e.g., `frontend/src/App.tsx` via a `useEffect`) without changing any immutable paths.",
        "Registration checks for `'serviceWorker' in navigator` and avoids throwing errors on unsupported browsers.",
        "In production builds, the service worker registers and controls the page after reload; in development, the app does not spam console errors if the service worker is absent."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Add a simple, user-facing way for users to install Vibechat (PWA) from the unauthenticated experience, with clear English text explaining that installation availability depends on the browser/device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PWA can do"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated UI (e.g., `LandingPage` and/or `PreLoginIntroPage`) includes an \"Install Vibechat\" action when the browser fires the install prompt event (or otherwise provides a short message if install is not available).",
        "User-facing text is in English and does not claim installation is always available; it clearly indicates it depends on the browser/device.",
        "If the install prompt is available, clicking the install action triggers the browser install prompt (where supported).",
        "If the install prompt is not available, the UI shows a helpful fallback message such as \"To install, open your browser menu and choose 'Add to Home Screen' (if available).\""
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui` (compose instead).",
    "No backend changes are required for PWA enablement.",
    "All user-facing text added for PWA install guidance must be in English."
  ],
  "nonGoals": [
    "Publishing Vibechat as a native Android APK or iOS App Store app.",
    "Adding push notifications.",
    "Adding background sync or complex offline-first data storage for chats/messages."
  ],
  "imageRequirements": {
    "required": [
      "PWA app icon with a clean centered Vibechat mark on an opaque background (vibechat-pwa-icon.dim_192x192.png)",
      "PWA app icon with a clean centered Vibechat mark on an opaque background (vibechat-pwa-icon.dim_512x512.png)",
      "Maskable PWA app icon with safe padding and centered mark (vibechat-pwa-icon-maskable.dim_512x512.png)",
      "Apple touch icon with centered mark on an opaque background (vibechat-apple-touch-icon.dim_180x180.png)",
      "Favicon with simplified mark (vibechat-favicon.dim_32x32.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Make Vibechat installable as a PWA (manifest, icons, service worker) so users can add it to their home screen like a normal app."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}