{
  "kind": "build_request",
  "title": "Replace advisory/landing UI with WhatsApp-like main navigation (Chats, Groups, Status, Live, Videos)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Remove the current advisory/marketing-style landing experience and make the authenticated app experience start on a WhatsApp-like main navigation flow where the primary sections are: Chats, Groups, Status, Live, Videos (in that order).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you remove all that advisement and add just like Whatsapp starting with chats, groups , status then live then videos"
        ]
      },
      "acceptanceCriteria": [
        "When a signed-in user opens the app, the default selected section is Chats (not the marketing landing page).",
        "The app presents top-level navigation sections in this exact order: Chats, Groups, Status, Live, Videos.",
        "The prior landing/marketing/advisory content is no longer shown as a primary screen for authenticated users."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update the existing top navigation (AppHeader) to reflect WhatsApp-like section navigation: show actions/tabs for Chats, Groups, Status, Live, and Videos in that order; remove any non-essential navigation items that are not part of this WhatsApp-like top-level experience (e.g., do not show “Contacts” as a top-level item).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add just like Whatsapp starting with chats, groups , status then live then videos"
        ]
      },
      "acceptanceCriteria": [
        "On desktop widths, the header shows clickable navigation items for Chats, Groups, Status, Live, Videos in that order.",
        "On mobile widths, the overflow menu (or mobile nav equivalent) lists Chats, Groups, Status, Live, Videos in that order.",
        "Selecting each section updates the UI to the corresponding screen/view and visually indicates the active section."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Add placeholder screens/views for Groups, Status, Live, and Videos so navigation works end-to-end, with clear English “Coming soon” messaging and no backend changes required.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add just like Whatsapp starting with chats, groups , status then live then videos"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to Groups shows a dedicated Groups screen with an English placeholder message (e.g., “Groups is coming soon.”).",
        "Navigating to Status shows a dedicated Status screen with an English placeholder message (e.g., “Status is coming soon.”).",
        "Navigating to Live shows a dedicated Live screen with an English placeholder message (e.g., “Live is coming soon.”).",
        "Navigating to Videos shows a dedicated Videos screen with an English placeholder message (e.g., “Videos is coming soon.”).",
        "No new backend methods are required to support these placeholder screens."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the paths listed in frontend.immutablePaths must not be edited directly.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo); do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Implementing real Groups functionality (creating/managing group chats, membership, group messaging).",
    "Implementing real Status functionality (stories/status posting, expiration, viewers).",
    "Implementing real Live or Videos features beyond placeholder screens.",
    "Adding third-party authentication (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}