{
  "kind": "build_request",
  "title": "Enable profile photo selection from gallery and camera capture",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the profile photo picker in the WhatsApp-style auth/profile flow to support selecting an image from the device photo gallery and (on supported mobile browsers) taking a new photo using the device camera, without requiring any backend changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "No let the app have permission to take photos from gallery"
        ]
      },
      "acceptanceCriteria": [
        "In the profile setup step (profile photo area), users can choose an existing image from their device gallery using the existing file picker flow.",
        "In the profile setup step, users have an explicit UI option to take a new photo (e.g., a “Take photo” action) that uses a camera-capable file input (e.g., input capture) on supported mobile browsers.",
        "The image validation rules continue to apply (type and max size) and any validation errors are shown in clear English.",
        "If the browser/device does not support camera capture or the user denies permission, the UI shows a clear English message and the user can still select a photo from the gallery.",
        "Selected/taken photos show a preview immediately (using the existing preview behavior) and continue to upload/save through the existing profile save flow."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui must not be edited (compose instead).",
    "Do not add new backend services or external integrations; keep all changes within the existing React app and existing profile save API."
  ],
  "nonGoals": [
    "Implementing SMS/MMS-based photo retrieval or any phone OS-level permissions beyond what the browser file/camera picker provides.",
    "Adding a new backend image storage system or changing how profile pictures are stored server-side."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}