{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "WhatsApp-inspired Chats UI and media-enabled messaging (frontend)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Implement a WhatsApp-inspired (not branded) Chats screen with conversation list and responsive conversation detail layout.",
      "acceptanceCriteria": [
        "App has a clear Chats entry point (in the main content area) that shows a conversation list.",
        "Clicking a conversation opens a conversation detail view with a message timeline and a message composer.",
        "User-facing text is in English and does not mention WhatsApp branding as if it were the same product.",
        "Layout is responsive: usable on narrow mobile widths and on desktop widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a Chats entry point in the main content area and switch main content between the existing LandingPage (unauthenticated) and the new Chats UI (authenticated). Wire selection state for active conversation and mobile/desktop layout behavior. Use existing authorization/auth flows (Internet Identity) to ensure chat UI is only visible after login; verify the authorization component usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Add a Chats navigation action (desktop button + mobile overflow item) that routes the user into the Chats screen in the main content area. Keep English labels and Vibechat branding (no WhatsApp naming). Use shadcn-ui primitives already present for buttons/menus; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ChatsPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Chats screen that renders a left-side conversation list and a conversation detail area (split view on desktop; list/detail navigation on mobile). Provide a clear empty state and calls-to-action to start a new conversation. Use shadcn-ui layout primitives (cards, buttons, inputs, separators) as appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/ConversationList.tsx",
          "operation": "create",
          "description": "Implement a conversation list component showing the caller's conversations, selection state, loading skeleton/placeholder, and error state. Keep the UI familiar (chat list rows with title/subtitle placeholders) without copying proprietary WhatsApp assets. Use shadcn-ui components for list row styling and loading states; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/ConversationDetail.tsx",
          "operation": "create",
          "description": "Implement the conversation detail shell: header (conversation title + back on mobile), scrollable message timeline area, and message composer anchored to bottom. Ensure responsive behavior (mobile safe areas, proper scrolling). Use shadcn-ui components for header/buttons and any scroll containers; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Wire frontend chat functionality to the backend using React Query: list conversations, load messages, and send messages with optional photo/video attachments selected from device.",
      "acceptanceCriteria": [
        "User can start/open a conversation from the Chats screen with a selected contact (from existing contacts match results) or by entering a principal/identifier supported by the UI.",
        "User can send a text message and see it appear in the message timeline.",
        "User can attach an image or video file to a message, send it, and see it rendered in the timeline (image preview or a video player/thumbnail + download/open link).",
        "UI shows clear English loading/progress and error states for sending and loading messages/attachments.",
        "All new backend calls are wrapped in React Query hooks (consistent with existing query/mutation patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for chat capabilities consistent with existing patterns: list caller conversations, create/open conversation, load messages for a conversation, and send a message. Include cache keys, enabled-guards based on actor availability, and user-friendly English error mapping (including Unauthorized handling). This continues the authorization pattern requiring login before data access; verify the authorization component usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/NewConversationDialog.tsx",
          "operation": "create",
          "description": "Add a dialog for starting/opening a conversation by entering a Principal/identifier supported by the UI (required path), and optionally allow initiating from existing matched contacts where feasible in the current UI. Provide clear validation and English error feedback. Use shadcn-ui Dialog/Input/Button components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/MessageComposer.tsx",
          "operation": "create",
          "description": "Create a message composer with text input + attachment picker (image/video) from device. On send, build the message payload, show sending/progress states, and disable controls appropriately. For attachments, use blob-storage's ExternalBlob (fromBytes + withUploadProgress) to upload and track progress; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/MessageTimeline.tsx",
          "operation": "create",
          "description": "Render message list with grouping/spacing similar to familiar chat apps (without copying exact branding). Show sender context (e.g., You vs others) based on the current Internet Identity principal. Render attachments: photos as image previews, videos via a video player, using ExternalBlob.getDirectURL() for safe direct access; verify the blob-storage component usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/readFileAsBytesAny.ts",
          "operation": "create",
          "description": "Add a utility to read arbitrary File (photo/video) into Uint8Array for attachment uploads, including basic size/type checks and clear thrown errors for UI display."
        },
        {
          "path": "frontend/src/pages/ChatsPage.tsx",
          "operation": "modify",
          "description": "Wire React Query hooks into the Chats screen: fetch conversation list, select a conversation to load messages, open the NewConversationDialog, and integrate MessageTimeline + MessageComposer. Ensure clear English loading/error states across list, detail, and sending."
        },
        {
          "path": "frontend/src/components/ContactsSyncDialog.tsx",
          "operation": "modify",
          "description": "Add an optional affordance to 'Start chat' from matched contact results that routes users into the Chats screen and pre-fills the new conversation flow with whatever identifier is available in the UI. If a Principal is not available from matched contacts, provide a clear English prompt guiding the user to enter the recipient's Principal/identifier in the New Conversation dialog. Use shadcn-ui components already present; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}