{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "WhatsApp-like main navigation (Chats, Groups, Status, Live, Videos) replacing landing for authenticated users",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Replace the authenticated default experience so signed-in users start in a WhatsApp-like main navigation flow with Chats as the default section (no marketing landing as primary screen).",
      "acceptanceCriteria": [
        "When a signed-in user opens the app, the default selected section is Chats (not the marketing landing page).",
        "The app presents top-level navigation sections in this exact order: Chats, Groups, Status, Live, Videos.",
        "The prior landing/marketing/advisory content is no longer shown as a primary screen for authenticated users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update app view state so unauthenticated users see the existing LandingPage, while authenticated users start on a WhatsApp-like section-based flow with Chats as the default selected section and section switching rendering the corresponding screen. Ensure landing/marketing content is not the primary screen for authenticated users."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Update AppHeader to provide WhatsApp-like top-level section navigation (Chats, Groups, Status, Live, Videos) in order across desktop and mobile, removing non-essential top-level items like Contacts.",
      "acceptanceCriteria": [
        "On desktop widths, the header shows clickable navigation items for Chats, Groups, Status, Live, Videos in that order.",
        "On mobile widths, the overflow menu (or mobile nav equivalent) lists Chats, Groups, Status, Live, Videos in that order.",
        "Selecting each section updates the UI to the corresponding screen/view and visually indicates the active section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Refactor AppHeader to switch from the current landing/chats + extra buttons model to a section navigation model with exactly these primary items in order: Chats, Groups, Status, Live, Videos. Keep active-state styling based on the current section. Remove Contacts as a top-level item (it may be moved behind a secondary menu if still needed). Use the shadcn-ui Button and DropdownMenu components for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update AppHeader integration to pass/receive the new section-based navigation props (current section + setter) so selecting header items switches the rendered screen and the active state is consistent across desktop/mobile."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add placeholder screens for Groups, Status, Live, and Videos with clear English 'Coming soon' messaging (no backend changes).",
      "acceptanceCriteria": [
        "Navigating to Groups shows a dedicated Groups screen with an English placeholder message (e.g., “Groups is coming soon.”).",
        "Navigating to Status shows a dedicated Status screen with an English placeholder message (e.g., “Status is coming soon.”).",
        "Navigating to Live shows a dedicated Live screen with an English placeholder message (e.g., “Live is coming soon.”).",
        "Navigating to Videos shows a dedicated Videos screen with an English placeholder message (e.g., “Videos is coming soon.”).",
        "No new backend methods are required to support these placeholder screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GroupsPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Groups placeholder screen with clear English 'Coming soon' messaging (no backend calls). Use shadcn-ui primitives (e.g., Card/Typography/Button if needed) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StatusPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Status placeholder screen with clear English 'Coming soon' messaging (no backend calls). Use shadcn-ui primitives for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "create",
          "description": "Create a dedicated Live placeholder screen with clear English 'Coming soon' messaging (no backend calls). Use shadcn-ui primitives for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Videos placeholder screen with clear English 'Coming soon' messaging (no backend calls). Use shadcn-ui primitives for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Groups/Status/Live/Videos pages into the authenticated section renderer so navigation works end-to-end without requiring any backend changes."
        }
      ]
    }
  ]
}